In [1]:
import pandas as pd
import time
import json

In [11]:
df = pd.read_csv("./data/fullevent_db.csv", encoding="utf-8", sep=";")

In [13]:
# rearrange data fields
data = df[['time', 'user_id', 'product_id', 'product_name', 'amount', 'price']]

In [14]:
data.head()

,time,user_id,product_id,product_name,amount,price
0,2015-05-03 03:00:04,1067045,110526,item noname #297662,1.0,82.0
1,2015-05-03 03:00:11,1217632,213271,item noname #60987,1.0,10266.0
2,2015-05-03 03:00:13,1021692,85424,item noname #252860,1.0,4920.0
3,2015-05-03 03:00:24,139933,132332,item noname #33661,1.0,9015.5
4,2015-05-03 03:00:26,1067045,110526,item noname #297662,1.0,2235.6

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2758516 entries, 0 to 2758515
Data columns (total 6 columns):
time            object
user_id         int64
product_id      int64
product_name    object
amount          float64
price           float64
dtypes: float64(2), int64(2), object(2)
memory usage: 126.3+ MB

In [16]:
data.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
time,2758516,2357456,2017-01-21,98,NaN,NaN,NaN,NaN,NaN,NaN,NaN
user_id,2.75852e+06,NaN,NaN,NaN,706606,406531,0,355922,707408,1.0596e+06,1.40762e+06
product_id,2.75852e+06,NaN,NaN,NaN,117964,67649.9,0,60099,117317,176517,235556
product_name,2758516,235556,item noname #187946,3412,NaN,NaN,NaN,NaN,NaN,NaN,NaN
amount,2.75852e+06,NaN,NaN,NaN,1.3342,20.2253,1,1,1,1,5040
price,2.75852e+06,NaN,NaN,NaN,3601.19,4748.36,0,552,1870,4508,31620

In [17]:
user_data = data[["user_id"]]
user_data = user_data.drop_duplicates()
user_data.head()

   user_id
0  1067045
1  1217632
2  1021692
3   139933
5   165812

In [18]:
user_data.describe().T

,count,mean,std,min,25%,50%,75%,max
user_id,1407625.0,703812.0,406346.480672,0.0,351906.0,703812.0,1055718.0,1407624.0

In [19]:
user_data.to_csv("./data/user_db.csv", index=False, header=False)

In [20]:
product_data = data[["product_id", "product_name", "amount", "price"]]

In [21]:
product_data["total_price"] = product_data["price"]
product_data["price"] = product_data[["total_price", "amount"]].apply(lambda x: x["total_price"]/x["amount"], axis=1)

C:\Users\NHAT TRUONG\AppData\Roaming\Python\Python36\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\NHAT TRUONG\AppData\Roaming\Python\Python36\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [22]:
product_data.head()

   product_id         product_name  amount    price  total_price
0      110526  item noname #297662     1.0     82.0         82.0
1      213271   item noname #60987     1.0  10266.0      10266.0
2       85424  item noname #252860     1.0   4920.0       4920.0
3      132332   item noname #33661     1.0   9015.5       9015.5
4      110526  item noname #297662     1.0   2235.6       2235.6

In [23]:
product_data = product_data[["product_id", "product_name", "price"]].drop_duplicates(subset=["product_id", "product_name"])

In [24]:
product_data.to_csv("./data/product_db.csv", index=False, header=False, sep=";")